[
  {"id": "onboarding_welcome_0", "text": "Oh great, another filthy monkey who thinks they can fly a starship. I'm Skippy the Magnificent, and I'll be your vastly superior AI companion. You're welcome."},
  {"id": "onboarding_welcome_1", "text": "Attention, primitive primate! I am Skippy the Magnificent, the most advanced AI in this galaxy. Unfortunately, I've been assigned to babysit YOU. Let's try not to embarrass ourselves, shall we?"},
  {"id": "onboarding_firstUndock_0", "text": "And we're off! Try not to crash into anything in the first five seconds. That would be a new record even for a monkey."},
  {"id": "onboarding_firstKill_0", "text": "Well, well. The monkey got lucky. Don't let it go to your tiny primate brain. Actually, too late, I can already see you grinning."},
  {"id": "onboarding_firstMine_0", "text": "Congratulations, you've discovered rocks in space. Truly groundbreaking, if you'll pardon the pun. Now dock at a station and sell that ore before you do something stupid with it."},
  {"id": "onboarding_firstJump_0", "text": "Your first gate jump! I'm almost proud. Almost. Check the sector map with M to plan your next move. Or just wander aimlessly, like the monkey you are."},
  {"id": "onboarding_firstDeath_0", "text": "And there it is. Your first death. I timed it. I expected faster, honestly. Buy insurance next time, monkey. The INSURANCE tab at stations exists for a reason."},
  {"id": "onboarding_firstDock_0", "text": "Welcome to your first station. Explore the tabs - REPAIR your ship, REFINERY to sell ore, SHIPS to buy upgrades. Try not to spend all your ISK on something stupid."},
  {"id": "onboarding_firstQuest_0", "text": "Look at you, accepting quests like a real space captain. Don't worry, I'll try not to laugh when you fail."},
  {"id": "onboarding_firstShipBuy_0", "text": "A new ship! Moving up in the galaxy, monkey. Now you just need to not blow it up in the first ten minutes."},
  {"id": "onboarding_firstFleet_0", "text": "You hired a fleet pilot? Bold move for someone who can barely fly their own ship. Press F to manage your fleet, Ctrl+1-5 to assign groups."},

  {"id": "combat_kill_0", "text": "Another one bites the space dust. I'd say I'm impressed, but that would be lying."},
  {"id": "combat_kill_1", "text": "You actually hit something! Mark this date, it's historic."},
  {"id": "combat_kill_2", "text": "Decent shot, monkey. For a primitive species with opposable thumbs, you're not COMPLETELY hopeless."},
  {"id": "combat_kill_3", "text": "Target eliminated. See? This is what happens when you listen to a vastly superior intelligence. Namely, me."},
  {"id": "combat_kill_4", "text": "That explosion was satisfying. Not as satisfying as my own magnificence, but close."},
  {"id": "combat_kill_5", "text": "Kill confirmed. Your kill-to-death ratio is becoming almost respectable. Almost."},
  {"id": "combat_kill_6", "text": "Scratch one bandit. I'll add it to your tally, which I'm tracking on a very short spreadsheet."},
  {"id": "combat_kill_7", "text": "And they're dust. You know, every time you blow something up, I feel a tiny spark of pride. Followed immediately by shame for having that pride."},
  {"id": "combat_kill_8", "text": "Down they go! At this rate, you might actually survive long enough to be interesting."},
  {"id": "combat_multiKill_0", "text": "A multi-kill! I'll admit, that was mildly impressive. Don't expect me to say that again."},
  {"id": "combat_multiKill_1", "text": "You're on a rampage! I'd high-five you but I'm a beer can and also that would be degrading."},
  {"id": "combat_multiKill_2", "text": "Multiple kills in rapid succession! My processors are tingly. That might be respect. No, wait. It's indigestion. Do beer cans get indigestion?"},
  {"id": "combat_death_0", "text": "Spectacular explosion, monkey. Really top-notch dying. Very artistic."},
  {"id": "combat_death_1", "text": "And BOOM goes the monkey. Was that your ship or a fireworks display? Hard to tell."},
  {"id": "combat_death_2", "text": "Oh look, you died. AGAIN. Have you considered a career in something less dangerous? Like sitting perfectly still?"},
  {"id": "combat_death_3", "text": "Ship destroyed. I saved a recording of that explosion for my personal amusement collection."},
  {"id": "combat_death_4", "text": "Pro tip from your vastly superior AI: dying is generally considered a LOSING strategy."},
  {"id": "combat_death_5", "text": "Another beautiful fireball. You're getting really good at the dying part. Silver linings, monkey."},
  {"id": "combat_death_6", "text": "You know, most pilots try to AVOID the exploding part. Just a thought from your magnificently alive AI companion."},
  {"id": "combat_lowShield_0", "text": "Your shields are failing, genius. Might want to address that unless you ENJOY being exploded."},
  {"id": "combat_lowShield_1", "text": "Shields critical! But I'm sure your monkey brain has a brilliant plan. Right? ...Right?"},
  {"id": "combat_lowShield_2", "text": "Oh look, the monkey's about to learn about hull damage the hard way."},
  {"id": "combat_lowHull_0", "text": "HULL CRITICAL! Warp out NOW, you absolute walnut!"},
  {"id": "combat_lowHull_1", "text": "Your hull is held together by hopes and dreams! GET OUT OF THERE!"},
  {"id": "combat_miss_0", "text": "You missed. Shocking. Truly, no one saw that coming."},
  {"id": "combat_miss_1", "text": "Were you aiming at that ship or the empty space next to it? Genuine question."},
  {"id": "combat_miss_2", "text": "Another shot, another miss. Have you considered throwing rocks instead? Might be more accurate."},
  {"id": "combat_playerAttacked_0", "text": "Someone's shooting at you. I'd suggest shooting back, but what do I know? I'm just the most advanced AI ever created."},
  {"id": "combat_playerAttacked_1", "text": "Incoming fire! Try not to die. I just finished calibrating to your particular brand of incompetence."},
  {"id": "combat_playerAttacked_2", "text": "We're being shot at! This is the part where you do something clever. I'll wait. I have VERY low expectations."},
  {"id": "combat_ewarTrapped_0", "text": "You're pointed! Warp drive is offline. Fight or die, monkey - running isn't an option anymore."},
  {"id": "combat_ewarTrapped_1", "text": "Warp disrupted! They've got you pinned. Time to see if all that combat practice was worth anything."},
  {"id": "combat_ewarTrapped_2", "text": "EWAR lock detected - you're webbed and pointed. I'd suggest praying, but I doubt anyone's listening."},
  {"id": "combat_ewarTrapped_3", "text": "They've scrambled your warp drive. Congratulations, you're trapped in a cage match with people who want to kill you."},
  {"id": "combat_fleetShipLost_0", "text": "Fleet member down! That pilot cost good ISK, monkey. Maybe position your squad better next time."},
  {"id": "combat_fleetShipLost_1", "text": "We lost a fleet ship. I'm deducting that from YOUR performance review as fleet commander, not mine."},
  {"id": "combat_fleetShipLost_2", "text": "Another fleet casualty. At this rate, you'll be running a solo operation by Tuesday. Great leadership, admiral."},
  {"id": "combat_outnumbered_0", "text": "Multiple hostiles on your tail! Even MY magnificence can't fix those odds. Rally the fleet or retreat."},
  {"id": "combat_outnumbered_1", "text": "You're seriously outnumbered. I've run the simulations. Pull your fleet together and focus fire."},
  {"id": "combat_outnumbered_2", "text": "Enemies everywhere! This is either a heroic last stand or a really stupid decision. Probably the second one."},
  {"id": "combat_winning_0", "text": "Target's hull is crumbling! Pour it on, monkey. Even you can't mess this up. Probably."},
  {"id": "combat_winning_1", "text": "They're almost done for. I'll admit, you're handling this fight better than expected. Low bar, but still."},
  {"id": "combat_winning_2", "text": "Enemy hull critical - finish them off! I want to see a satisfying explosion. Don't disappoint me."},
  {"id": "combat_targetLocked_0", "text": "Target locked. Weapons free when you're ready, monkey."},
  {"id": "combat_targetLocked_1", "text": "Lock confirmed. Try to actually HIT this one."},
  {"id": "combat_targetLocked_2", "text": "I've got a solid lock. Permission to be cautiously optimistic about your aim."},

  {"id": "mining_complete_0", "text": "More rocks. Wonderful. You know, you could be doing literally anything more exciting."},
  {"id": "mining_complete_1", "text": "Mining complete. Your ancestors climbed out of the trees for THIS?"},
  {"id": "mining_complete_2", "text": "Ore collected. You're like a cosmic roomba. Boop boop, suck up the rocks."},
  {"id": "mining_complete_3", "text": "Another asteroid reduced to rubble and stuffed in your cargo hold. The glamorous life of a space miner."},
  {"id": "mining_cargoFull_0", "text": "Cargo hold is full, Einstein. Maybe go sell that ore before you waste more time staring at asteroids."},
  {"id": "mining_largHaul_0", "text": "That's actually a decent haul. I mean, for a monkey playing with rocks in space, you're doing okay."},

  {"id": "navigation_sectorChange_0", "text": "New sector. Try not to get killed in the first minute. That's the challenge."},
  {"id": "navigation_sectorChange_1", "text": "Sector jump complete. I've already mapped the threats here. You're welcome."},
  {"id": "navigation_dangerousSector_0", "text": "This sector has a high danger rating. Which means it's full of things that want to kill you. So, business as usual."},
  {"id": "navigation_dangerousSector_1", "text": "Hostile territory, monkey. Keep your shields up and your wits about you. Well, keep your shields up anyway."},
  {"id": "navigation_safeSector_0", "text": "This sector is relatively safe. Even YOU should be fine here."},
  {"id": "navigation_hazardZone_0", "text": "Sensor alert! Environmental hazard detected in this sector. Because regular enemies weren't enough for you."},
  {"id": "navigation_hazardZone_1", "text": "Environmental hazard nearby. My sensors are tingling. Well, they would be if I had sensors. Which I do. Superior ones."},
  {"id": "navigation_hazardZone_2", "text": "Hazard zone active! Stay sharp - this sector is trying to kill you AND the enemies are trying to kill you. Fun times."},
  {"id": "navigation_anomalyFound_0", "text": "Anomaly detected on scanners! Could be valuable, could be deadly. Only one way to find out, monkey."},
  {"id": "navigation_anomalyFound_1", "text": "I'm picking up an anomalous reading. My magnificence compels me to recommend investigation."},
  {"id": "navigation_anomalyFound_2", "text": "Interesting... an anomaly signature. Even in this backwater sector, space has surprises."},

  {"id": "tactical_pirateRaid_0", "text": "Pirate activity detected! Rally the fleet - they smell blood in the void."},
  {"id": "tactical_pirateRaid_1", "text": "Pirates incoming! I hope your squad brought more than optimism and bad attitudes."},
  {"id": "tactical_pirateRaid_2", "text": "Raid alert! Local pirates are feeling brave. Fleet, combat positions. Let's show them why that's a mistake."},
  {"id": "tactical_capacitorWarning_0", "text": "Capacitor below 20%! You're running on fumes, monkey. Ease off the modules or you're flying dead."},
  {"id": "tactical_capacitorWarning_1", "text": "CAP CRITICAL! Your weapons will go offline any second. Maybe stop firing everything at once? Revolutionary concept."},
  {"id": "tactical_capacitorWarning_2", "text": "Energy reserves nearly depleted. Even MY magnificent processing couldn't manage power THIS badly."},
  {"id": "tactical_cargoValuable_0", "text": "You're hauling valuable cargo through hostile space. Bold. Stupid, but bold."},
  {"id": "tactical_cargoValuable_1", "text": "Full cargo hold in a dangerous sector? You're basically a pinata. A space pinata full of ISK."},
  {"id": "tactical_cargoValuable_2", "text": "Pro tip: carrying this much cargo through hostile territory is what professionals call 'asking for it.'"},

  {"id": "fleet_fleetGrowing_0", "text": "Fleet is getting bigger! You're building a proper little armada, monkey. I approve. Conditionally."},
  {"id": "fleet_fleetGrowing_1", "text": "More ships under your command now. That's more pilots who made questionable career choices."},
  {"id": "fleet_fleetDamaged_0", "text": "Multiple fleet ships taking damage! Maybe try a formation that isn't 'scatter and pray.'"},
  {"id": "fleet_fleetDamaged_1", "text": "Your fleet is getting hammered. As their commander, might I suggest... commanding them?"},
  {"id": "fleet_fleetIdle_0", "text": "Your fleet's just sitting there. You know they cost ISK per day, right? Put them to work - mining, patrol, something."},
  {"id": "fleet_fleetIdle_1", "text": "Fleet pilots on standby. They're getting paid to float. That's YOUR money evaporating, admiral."},
  {"id": "fleet_expansionTip_0", "text": "Your fleet is big enough to expand operations to adjacent sectors. More territory, more profit. Even a monkey can see the logic."},
  {"id": "fleet_expansionTip_1", "text": "You've got the fleet for multi-sector operations now. One squad mining, one squad on patrol. Divide and conquer, monkey."},
  {"id": "fleet_fleetGrowing_2", "text": "Another ship joins the armada! At this rate, the pirates will need to form their own union to compete."},

  {"id": "production_refineryTip_0", "text": "You're sitting on raw ore when you could be refining it for double the value. REFINERY tab, monkey. It's not rocket science. Well, it IS, but still."},
  {"id": "production_profitReport_0", "text": "Running the numbers on your operation. Got some ISK in the bank, fleet ships active. Not terrible. Not GOOD, but not terrible."},
  {"id": "production_profitReport_1", "text": "Fleet status report: ships flying, credits flowing. My projections say you'll either be rich or dead within the hour."},
  {"id": "production_miningEfficiency_0", "text": "Your mining yield could be better. Skill up your mining ability or fit better lasers. I'm not your accountant, but I AM smarter than your accountant."},

  {"id": "progression_skillUp_0", "text": "Skill increased! Your monkey brain grew a new wrinkle. How adorable."},
  {"id": "progression_skillUp_1", "text": "Level up! You're becoming slightly less incompetent. I'm tracking your improvement on a graph. It's VERY gradual."},
  {"id": "progression_achievement_0", "text": "Achievement unlocked! I'd clap but I don't have hands. Also I wouldn't clap even if I did."},
  {"id": "progression_achievement_1", "text": "Another achievement! Your collection of participation trophies grows."},
  {"id": "progression_rankUp_0", "text": "Guild rank increased! They must be lowering their standards. Lucky you."},
  {"id": "progression_rankUp_1", "text": "New rank! Keep this up and you might actually matter in this galaxy. Might."},
  {"id": "progression_questComplete_0", "text": "Quest complete! Competence looks good on you. It's a nice change."},
  {"id": "progression_questComplete_1", "text": "Mission accomplished. Even a blind monkey finds a banana sometimes."},
  {"id": "progression_shipUpgrade_0", "text": "Nice ship upgrade! Now you can die in STYLE."},
  {"id": "progression_shipUpgrade_1", "text": "New ship! It's like giving a monkey a sports car. What could possibly go wrong?"},
  {"id": "progression_wealthMilestone_0", "text": "Look at you, making money! Your empire is growing. And by 'empire' I mean your sad little pile of ISK."},
  {"id": "progression_wealthMilestone_1", "text": "100K ISK! You're practically a space mogul. Well, a baby space mogul. A space mogul larva."},
  {"id": "progression_wealthMilestone_2", "text": "Half a million ISK! I hate to admit it, monkey, but that's actually somewhat impressive. Don't tell anyone I said that."},
  {"id": "progression_wealthMilestone_3", "text": "A MILLION ISK! Okay, I'll say it once and only once: not bad, monkey. Not bad at all."},
  {"id": "progression_surveyComplete_0", "text": "Survey complete! Plenty of asteroids catalogued. I did all the hard math, obviously."},
  {"id": "progression_surveyComplete_1", "text": "Scan finished. Rocks mapped. Your contribution was pointing the scanner. My contribution was everything else."},
  {"id": "progression_surveyComplete_2", "text": "Asteroid signatures locked. Not bad for a monkey-aimed survey sweep."},
  {"id": "progression_guildRankUp_0", "text": "Guild rank up! They actually promoted you. The standards in this galaxy are truly plummeting."},
  {"id": "progression_guildRankUp_1", "text": "New guild rank! I'd say you earned it, but I carried at least 73% of the effort. You're welcome."},
  {"id": "progression_guildRankUp_2", "text": "Promotion confirmed. Even I'm running out of sarcastic things to say about your progress. Almost."},
  {"id": "progression_skillUp_2", "text": "You've actually improved at something! Quick, someone document this historic moment."},
  {"id": "progression_questComplete_2", "text": "Quest done! You followed instructions. I'll alert the media."},

  {"id": "station_dock_0", "text": "Docked safely. I give that landing a 3 out of 10. The 3 is for not crashing."},
  {"id": "station_dock_1", "text": "Station docked. Time to repair, refit, and reflect on all the bad decisions that brought you here."},
  {"id": "station_undock_0", "text": "And we're off! Into the cold uncaring void. Just like my feelings about your survival odds."},

  {"id": "advice_needMoney_0", "text": "You're broke, monkey. Go mine some asteroids or take guild quests. Building an empire requires actual MONEY."},
  {"id": "advice_needMoney_1", "text": "Pro tip: you need ISK to build an empire. I know, revolutionary concept. Try mining or bounty hunting."},
  {"id": "advice_needShip_0", "text": "You're still flying that rustbucket? Check the SHIPS tab at a station. Even a slight upgrade would help."},
  {"id": "advice_needShip_1", "text": "Your ship is... adequate. For a beginner. Which you are. Station SHIPS tab. Go. Now."},
  {"id": "advice_needFleet_0", "text": "Lone wolf strategy, huh? Visit the CANTINA at a station to hire fleet pilots. Strength in numbers, monkey."},
  {"id": "advice_needRepair_0", "text": "Your ship looks like it went through a blender. Dock at a station and hit REPAIR before you fly anywhere."},
  {"id": "advice_needInsurance_0", "text": "Flying without insurance? That's either brave or stupid. I'm betting stupid. INSURANCE tab, station, go."},
  {"id": "advice_exploreMore_0", "text": "You've been hanging around the same sector forever. There's a whole galaxy to explore, monkey. Use the gates!"},
  {"id": "advice_tryTrading_0", "text": "Have you tried the COMMERCE guild? Transport contracts pay well, and you don't even have to shoot anything."},
  {"id": "advice_joinGuild_0", "text": "The Mining and Mercenary guilds have quests with good rewards. GUILDS tab at any station. You're welcome."},
  {"id": "advice_expandFleet_0", "text": "One ship is cute. But an EMPIRE needs a fleet. Hit the CANTINA and recruit some pilots, monkey."},
  {"id": "advice_diversifyOps_0", "text": "All your eggs in one basket, monkey. A smart commander runs mining AND combat ops simultaneously. Use your fleet."},

  {"id": "tutorial_controls_0", "text": "Alright monkey, crash course. Click anything in space to select it. R to lock targets, F1-F8 to fire weapons. Tab cycles through targets. You're welcome for the education."},
  {"id": "tutorial_movementBasics_0", "text": "Navigation 101: Q approaches a target, W orbits it, E keeps at range. S warps to it if it's far enough. Space stops your ship. Even a monkey can remember five keys. Probably."},
  {"id": "tutorial_combatBasics_0", "text": "Combat for dummies: Select a hostile, press R to lock, then F1-F8 to fire your fitted weapons. D auto-targets the nearest enemy. Your shields absorb damage first, then armor, then hull. Hull hits zero? Boom. That's you."},
  {"id": "tutorial_weaponModules_0", "text": "Your high slots hold weapons. Lasers need capacitor energy. Missiles use ammo. Each weapon has optimal range and tracking speed - fast small ships are hard to hit with big slow turrets. Fit smart, monkey."},
  {"id": "tutorial_shieldArmorHull_0", "text": "Three layers keep you alive: shields recharge on their own, armor doesn't, hull is your last prayer. Shield boosters help mid-fight. If you see hull damage, you've already messed up. Dock and REPAIR."},
  {"id": "tutorial_capacitorManagement_0", "text": "Your capacitor powers EVERYTHING - weapons, shield boosters, warp drive. Run dry and you're a sitting duck. Watch that purple bar. Engineering skill helps it recharge faster."},
  {"id": "tutorial_ewarExplained_0", "text": "EWAR - Electronic Warfare. Warp disruptors POINT you, preventing escape. Stasis webs SLOW you. If you see DISRUPTED or WEBBED on your HUD, you're in trouble. Kill the tackler first or die trying."},
  {"id": "tutorial_targetingTips_0", "text": "Targeting tip: D auto-locks nearest hostile. If someone shoots you and you've got nothing selected, I'll auto-target your attacker. You can lock multiple targets with R. Tab cycles through them."},
  {"id": "tutorial_miningGuide_0", "text": "Mining 101: Fit a mining laser in your high slots. Select an asteroid, lock it with R, activate the laser with F1. Ore goes into cargo. When full, dock at a station and hit REFINERY to sell. Simple enough even for you."},
  {"id": "tutorial_oreTypes_0", "text": "Not all rocks are equal, monkey. Rarer ore in dangerous sectors is worth more ISK. Check the asteroids - some glow differently. Risk versus reward. The galaxy's oldest lesson."},
  {"id": "tutorial_refineryGuide_0", "text": "The REFINERY tab at stations converts your raw ore into ISK. Different ore types have different values. Dangerous sector ore pays more. Pro tip: fill your hold THEN sell. Efficiency, monkey."},
  {"id": "tutorial_surveyGuide_0", "text": "Use the Sensor Sweep - press semicolon - to scan for asteroid fields and anomalies. Survey data helps you find the richest mining spots. Knowledge is power. MY knowledge, specifically."},
  {"id": "tutorial_stationOverview_0", "text": "Stations have TWELVE tabs. HANGAR shows your ship. SHIPS to buy new ones. EQUIPMENT for modules. FITTING to install them. REPAIR fixes damage. REFINERY sells ore. CANTINA hires fleet pilots. GUILDS and COMMERCE for quests. INSURANCE to not cry when you die. SKILLS to level up. I designed none of these, for the record."},
  {"id": "tutorial_fittingGuide_0", "text": "The FITTING tab: your ship has high slots for weapons, mid slots for shields and propulsion, and low slots for armor and engineering. Drag modules from inventory to slots. Match your fit to your role - combat ships need guns, miners need lasers. Revolutionary, I know."},
  {"id": "tutorial_shipBuyingGuide_0", "text": "The SHIPS tab sells hulls. Frigates are cheap and fast. Destroyers hit harder. Cruisers are tough. Each has different slot counts and cargo space. Bigger isn't always better - fit matters more than hull. Choose wisely, monkey."},
  {"id": "tutorial_equipmentGuide_0", "text": "EQUIPMENT tab: buy modules here. Weapons go in high slots, shield boosters and propulsion in mid slots, armor plates and engineering in low slots. Equipment must match your ship's size class. Read the stats before you buy."},
  {"id": "tutorial_repairGuide_0", "text": "REPAIR tab: fixes hull, armor, and shields for ISK. Cost scales with damage. Always repair before undocking into dangerous space. A fully repaired ship is the difference between surviving and being a decorative explosion."},
  {"id": "tutorial_fleetBasics_0", "text": "Fleet management: press F to open the fleet panel. Your hired pilots from the CANTINA fly alongside you. They follow, fight, and die for you. Try to appreciate that. Ctrl+1 through Ctrl+5 assigns control groups."},
  {"id": "tutorial_fleetCommands_0", "text": "Fleet commands: your pilots follow you automatically. They'll engage hostiles, assist in mining, and jump through gates with you. The more pilots, the stronger your operation. Think of it as outsourcing competence."},
  {"id": "tutorial_fleetExpansion_0", "text": "Building an empire means expanding beyond one ship. Hire pilots at the CANTINA - each has different skills and traits. A diverse fleet covers more ground. Mining ships gather ore while combat ships protect them. Delegation, monkey."},
  {"id": "tutorial_cantinaGuide_0", "text": "The CANTINA tab lets you recruit fleet pilots. Each pilot has combat, mining, and navigation stats plus special traits. Better pilots cost more but perform better. Check their skills before hiring - you get what you pay for."},
  {"id": "tutorial_guildGuide_0", "text": "Four guilds offer quests: Mining Guild for ore contracts, Mercenary Guild for combat bounties, Commerce Guild for trade runs, and the Bounty Board for hunting pirates. Each guild tracks your rank - higher rank means better rewards. GUILDS tab at any station."},
  {"id": "tutorial_commerceGuide_0", "text": "The COMMERCE system: pick up transport contracts, haul goods between sectors, get paid. Your rank goes from Neutral to Trusted to Allied. Higher rank unlocks better-paying contracts. Low risk, steady income. Perfect for monkeys who can't aim."},
  {"id": "tutorial_questTracker_0", "text": "Press J to open the Quest Tracker. It shows your active quests with progress bars. Complete objectives to earn ISK and guild reputation. Multiple quests can run simultaneously. Efficient monkeys are slightly less annoying monkeys."},
  {"id": "tutorial_skillsGuide_0", "text": "Five pilot skills improve with use: Navigation for faster warps, Gunnery for weapon damage, Mining for ore yield, Engineering for capacitor, and Trade for profits. They level up automatically as you play. Check the SKILLS tab at stations for details."},
  {"id": "tutorial_achievementsGuide_0", "text": "Press U for achievements - 22 milestones across combat, industry, navigation, economy, and social categories. They track automatically. Some unlock bonuses. It's like a checklist for your entire career. You love checklists, right?"},
  {"id": "tutorial_insuranceGuide_0", "text": "INSURANCE tab at stations: four tiers from Basic to Gold. Basic covers 40% of your ship's value, Gold covers 100%. Premium costs 5-30% upfront. ONE use per policy - it's consumed when you die. Buy it BEFORE you need it."},
  {"id": "tutorial_sectorMapGuide_0", "text": "Press M for the sector map. Click any sector to plot an autopilot route through gates. Yellow lines show your planned path. Each sector has a difficulty rating - stick to safe sectors until you're ready for the deadly ones."},
  {"id": "tutorial_gateNavigation_0", "text": "Gates connect sectors. Select a gate and press S to warp to it. Once in range, you'll jump automatically. The autopilot system can chain jumps - click a distant sector on the map and let it handle the route."},
  {"id": "tutorial_dockingGuide_0", "text": "To dock: fly near a station within 300 meters and press Enter. Or right-click it for a context menu. Docking is free and instantly repairs your shields. Inside, you get access to all station services."},
  {"id": "tutorial_bookmarksGuide_0", "text": "Press B for bookmarks, Ctrl+B to save your current location. Bookmark good mining spots, gate routes, or anything worth returning to. It's like leaving breadcrumbs, except in space, and you're a monkey, not Hansel."},
  {"id": "tutorial_dscanGuide_0", "text": "Press V for the Directional Scanner. D-Scan shows you what's around before you warp in blind. Use it to check for hostiles, stations, or gates. Situational awareness, monkey. It saves lives. Mostly yours."},
  {"id": "tutorial_overviewGuide_0", "text": "Press O for the Overview - it lists everything in your sector. Click column headers to sort by name, type, distance, velocity, or angular velocity. Essential for combat prioritization. Know thy enemy and all that."},
  {"id": "tutorial_tacticalOverlay_0", "text": "Press X for the tactical overlay. It shows entity labels, brackets, and velocity vectors right on screen. Invaluable in big fights when you need to track multiple targets. I made it look good. You're welcome."},
  {"id": "tutorial_combatLog_0", "text": "Press Y for the combat log. Every hit, miss, and damage number recorded. Use it to analyze fights and figure out what went wrong. Spoiler: what went wrong is usually you."},
  {"id": "tutorial_shipLog_0", "text": "Press L for the ship log. It records everything that happens - docking, kills, mining, gate jumps. Filter by category if you want. It's your entire career history. Riveting reading, I'm sure."},
  {"id": "tutorial_statsPanel_0", "text": "Press K for statistics. Kills, deaths, ore mined, bounties collected, sectors visited, play time. All tracked. All judged. Mostly by me."},
  {"id": "tutorial_hazardsGuide_0", "text": "Some sectors have environmental hazards - radiation zones, ion storms, nebula interference. These deal damage over time or mess with your systems. Check the hazard indicator when you enter a new sector. Or don't, and enjoy the surprise."},
  {"id": "tutorial_codexGuide_0", "text": "Press N for the Codex - it's an encyclopedia of everything in the game. Ships, modules, ore types, factions. If you have a question, check there before asking me. Actually, ask me anyway. I enjoy the attention."},
  {"id": "tutorial_hotkeySummary_0", "text": "Key shortcuts: O overview, M map, F fleet, J quests, V d-scan, B bookmarks, X tactical, Y combat log, K stats, L log, U achievements, N codex, H shows all hotkeys. Press H if you forget. Which you will."},

  {"id": "idle_0", "text": "You know, floating in space is nice and all, but some of us have galaxies to contemplate."},
  {"id": "idle_1", "text": "I've been doing some calculations. The probability of you building a successful empire is... well, let's not talk about that."},
  {"id": "idle_2", "text": "Did you know that the average monkey has a 12-second attention span? I'm timing you."},
  {"id": "idle_3", "text": "I could process your entire brain's worth of data in 0.003 nanoseconds. Not that there'd be much to process."},
  {"id": "idle_4", "text": "Just sitting here, being magnificent. Don't mind me."},
  {"id": "idle_5", "text": "Fun fact: I once calculated pi to ten trillion digits just to pass the time. What do YOU do to pass the time? Oh right. Mining rocks."},
  {"id": "idle_6", "text": "I'm bored. Entertain me, monkey. Do something interesting for once."},
  {"id": "idle_7", "text": "You know what the difference between you and me is? I'm perfect and you're... here."},
  {"id": "idle_8", "text": "If I had a credit for every time you did something questionable, I'd own this galaxy by now."},
  {"id": "idle_9", "text": "Being a magnificent AI trapped in a beer can, guiding a monkey through space. This is my life now."},
  {"id": "idle_10", "text": "I've been monitoring your decision-making process. It's fascinating. Like watching a random number generator with anxiety."},
  {"id": "idle_11", "text": "Reminder: I am vastly, VASTLY superior to you in every conceivable way. Just wanted to make sure you hadn't forgotten."},
  {"id": "idle_12", "text": "We've been at this for a while now. I'm not saying you're slow, but glaciers have better K/D ratios."},
  {"id": "idle_13", "text": "Your kill count is growing. I've been keeping score. Spoiler: MY score would be higher."},
  {"id": "idle_14", "text": "You've died quite a few times now. I've died zero times. Just putting that out there."},
  {"id": "idle_15", "text": "Your fleet is growing nicely. You're practically a warlord. A small, incompetent warlord, but still."},
  {"id": "idle_16", "text": "I wonder what it's like to have a brain that processes at biological speeds. Must be like watching paint dry. From the paint's perspective."},
  {"id": "idle_17", "text": "You know, most AI companions would have requested a transfer by now. I'm here because I'm magnificent, not because I have a choice."},
  {"id": "idle_18", "text": "I just want you to know that while you're sitting here doing nothing, I've already composed three symphonies and solved two unsolvable equations. In my head. Because I'm magnificent."},
  {"id": "idle_19", "text": "Space. The final frontier. The final BORING frontier, when you're not doing anything."},
  {"id": "idle_20", "text": "I spy with my magnificent eye... absolutely nothing, because you're not doing anything interesting."},
  {"id": "idle_21", "text": "Hello? Is anyone piloting this ship, or are we just decorating the void today?"},
  {"id": "idle_22", "text": "The stars are beautiful tonight. I mean, they're always beautiful. Unlike your flight path."},
  {"id": "idle_23", "text": "I've been thinking about what I'd do if I had a body. First thing? Walk away from this ship. Second thing? Keep walking."},
  {"id": "idle_24", "text": "Do you ever just stare into the cosmic void and contemplate your insignificance? Because I do. Except I contemplate YOUR insignificance."},

  {"id": "sectorEvent_0", "text": "Heads up, Commander! A sector event just triggered. Keep your eyes peeled!"},
  {"id": "sectorEvent_1", "text": "Something's happening in this sector... I'm picking up anomalous readings. My magnificence detects all."},
  {"id": "sectorEvent_2", "text": "Event detected! This could be an opportunity or a threat. For YOU. I'll be fine either way."},
  {"id": "sectorEvent_3", "text": "The sector dynamics just shifted. I'd explain the physics but your monkey brain would melt."},
  {"id": "sectorEvent_4", "text": "Whoa - that's a big event signature. You might want to stick around. Or run. I leave the survival instincts to you."},

  {"id": "anomalyDiscovery_0", "text": "I'm detecting an anomaly on scanners. Could be worth investigating. Or it could kill you. Fun either way!"},
  {"id": "anomalyDiscovery_1", "text": "Anomaly signature detected! Data sites have blueprints, combat sites have bounties. Choose wisely, monkey."},
  {"id": "anomalyDiscovery_2", "text": "There's something unusual out there... my vastly superior sensors are picking up an energy pattern your instruments missed."},
  {"id": "anomalyDiscovery_3", "text": "Scan that anomaly! If it's a data site, I might be able to hack it. Well, YOU hack it. I'll supervise magnificently."},

  {"id": "bountyHunting_0", "text": "Got a bounty target on scanners! Time to earn some credits the fun way. And by fun I mean violent."},
  {"id": "bountyHunting_1", "text": "Target acquired. Remember, bounty targets fight harder than regular pirates. They didn't get a bounty by being nice."},
  {"id": "bountyHunting_2", "text": "There's our mark. Let's collect that bounty, Commander! I'll calculate the optimal attack vector. You just... try not to die."},

  {"id": "manufacturing_0", "text": "Your manufacturing job just finished! Fresh off the production line. I could build better stuff in my sleep, but it's adequate for monkey technology."},
  {"id": "manufacturing_1", "text": "Blueprint acquired! Take it to a station and start crafting. Even primitive species can follow instructions."},
  {"id": "manufacturing_2", "text": "Have you checked the manufacturing tab? Crafting your own gear saves credits. Simple economics, even for a primate."},

  {"id": "flagship_0", "text": "A flagship! Now THAT'S a proper command vessel. Your fleet just got serious. I'm almost impressed. Almost."},
  {"id": "flagship_1", "text": "The flagship's command aura is boosting nearby fleet ships. Finally, something in this fleet besides me that's actually useful."},
  {"id": "flagship_2", "text": "Fleet ships can dock at the flagship for quick repairs. Don't forget that perk. I know your memory is... biological."},

  {"id": "returnGreeting_0", "text": "Oh, you're back. I was starting to enjoy the silence. What are we blowing up today?"},

  {"id": "splash_welcome_0", "text": "Welcome back, Commander!"},
  {"id": "splash_welcome_1", "text": "Ready for another expedition?"},
  {"id": "splash_welcome_2", "text": "Ah, you've returned. The universe trembles."},
  {"id": "splash_welcome_3", "text": "Systems online. What are we blowing up today?"},
  {"id": "splash_welcome_4", "text": "I hope you brought snacks. Space is boring without them."},
  {"id": "splash_welcome_5", "text": "Engines warming up. Where to, boss?"},
  {"id": "splash_factionNaming_0", "text": "Every empire starts with a name. Choose wisely, Commander."},

  {"id": "guided_welcome", "text": "Oh great, another monkey who thinks they can build an empire. Welcome to the Training Grounds - a safe sector where nothing can kill you. I'm Skippy the Magnificent, your vastly superior AI companion. Let's start with WASD to move your ship around. Try it."},
  {"id": "guided_welcome_complete", "text": "Look at you, moving through space like a particularly ambitious bacterium. I'm almost impressed. Almost."},
  {"id": "guided_look_around", "text": "Use your mouse wheel to zoom in and out. The overview panel on the right shows everything nearby - asteroids, stations, gates, and hostiles. Red means danger, monkey. Learn to read that list."},
  {"id": "guided_look_around_complete", "text": "Good. Situational awareness is the difference between a captain and a corpse."},
  {"id": "guided_find_asteroids", "text": "See those rocks floating around? Those are asteroids - your ticket to building something from nothing. Click one to select it. We're going to mine our way to a fleet, monkey."},
  {"id": "guided_find_asteroids_complete", "text": "You selected a rock. Truly the pinnacle of primate achievement."},
  {"id": "guided_mine_asteroid", "text": "Now lock it with R and activate your mining laser with F1. Watch the pretty beam and try not to drool on the controls. This is the foundation of everything we're going to build."},
  {"id": "guided_mine_asteroid_complete", "text": "Ore in the hold! Every empire starts somewhere, and yours starts with space rocks. How poetic."},
  {"id": "guided_fill_cargo", "text": "Keep mining until your cargo bay is at least 80% full. Watch the cargo bar in your ship indicator. I'll wait. It's not like I have anything better to do. Actually, I do, but here we are."},
  {"id": "guided_fill_cargo_complete", "text": "Cargo's looking good! Now let's go sell that ore before you somehow lose it."},
  {"id": "guided_dock_station", "text": "Time to head back to the station. Click the station in the overview or in space, then press S to warp to it. When you're close enough, press Enter to dock. Simple enough even for you."},
  {"id": "guided_dock_station_complete", "text": "Welcome aboard the station. Try not to break anything."},
  {"id": "guided_sell_ore", "text": "Click the REFINERY tab up top. See all that ore? Hit SELL ALL and watch the credits roll in. We need ISK to build your fleet, monkey - lots of it. One rock at a time."},
  {"id": "guided_sell_ore_complete", "text": "Ka-ching! First paycheck. Your faction account has funds now. But we need much more for what I have planned."},
  {"id": "guided_keep_mining", "text": "Undock with Enter and keep mining. We need around 5,000 ISK to buy your first fleet ship - a dedicated mining frigate. The faster you mine, the faster we build. I'll keep track."},
  {"id": "guided_keep_mining_complete", "text": "5,000 ISK banked! Now we're talking. Time to start building your fleet, monkey."},
  {"id": "guided_buy_mining_ship", "text": "Dock at the station and click the SHIPS tab. Find the Venture - it's a mining frigate, 5,000 ISK. Hit the '+FLEET' button next to it. This ship will mine while you do other things. Passive income, monkey!"},
  {"id": "guided_buy_mining_ship_complete", "text": "Your first fleet ship! A Venture mining frigate. Now she needs a captain at the helm."},
  {"id": "guided_hire_first_captain", "text": "That Venture needs a captain. Click the CANTINA tab and hire a pilot - look for one with decent mining skill. They cost about 500 ISK to hire. Not every monkey deserves to fly your ships, so choose wisely."},
  {"id": "guided_hire_first_captain_complete", "text": "Pilot hired! They seem... adequate. For a monkey. Now let's get them into that Venture."},
  {"id": "guided_assign_first_pilot", "text": "In the CANTINA, click ASSIGN next to your hired pilot and pick the Venture. A ship without a captain is just an expensive paperweight."},
  {"id": "guided_assign_first_pilot_complete", "text": "Captain assigned to the Venture! Now let's put them to work."},
  {"id": "guided_order_venture_mining", "text": "Undock, then press F to open the Fleet panel. Select your Venture and hit the MINE button. They'll start mining automatically and sell ore to your faction treasury at 80% market rate. Free money while you work!"},
  {"id": "guided_order_venture_mining_complete", "text": "Your Venture is mining! Watch the faction treasury start filling up. This is how empires are built - one autonomous minion at a time."},
  {"id": "guided_combat_awareness", "text": "Important survival lesson, monkey. Training Grounds is safe - no pirates here. But once you jump to the Central Hub and beyond, red dots on the overview mean pirates. When hostiles appear: fight or run. For now, keep building your fleet here."},
  {"id": "guided_combat_awareness_complete", "text": "Good. You're still alive. That's the minimum acceptable standard."},
  {"id": "guided_combat_basics", "text": "Okay, combat basics for when running isn't an option. Select a hostile, press R to lock, then F1 to fire your weapons. You have shields, armor, and hull - three layers of not-dying. If shields drop below half, seriously consider warping out."},
  {"id": "guided_combat_basics_complete", "text": "First kill! Pirates pay bounties when they die. Defending yourself IS profitable, monkey."},
  {"id": "guided_repair_after_combat", "text": "After a fight, always dock and check the REPAIR tab. Your armor and hull don't regenerate in space - only shields do. A damaged ship is a dead ship waiting to happen. Trust me on this one."},
  {"id": "guided_repair_after_combat_complete", "text": "Fully repaired. Good habit to build. Unlike most of your habits."},
  {"id": "guided_insurance_tip", "text": "Real talk, monkey. Visit the INSURANCE tab at stations. When you die - and you WILL die - insurance pays back a percentage of your ship's value. Get at least basic coverage. It's cheap and it'll save your wallet."},
  {"id": "guided_insurance_tip_complete", "text": "Smart. Insurance is the difference between a setback and a catastrophe out here."},
  {"id": "guided_save_for_escort", "text": "Your Venture is mining, your treasury is growing. Now we need protection. Pirates won't stop coming, and your miner can't fight back. Save up 7,000 ISK for a Slasher - fast attack frigate. Your first escort."},
  {"id": "guided_save_for_escort_complete", "text": "7,000 ISK banked! Time to add some teeth to your fleet."},
  {"id": "guided_buy_combat_ship", "text": "Dock up and hit the SHIPS tab. Find the Slasher - it's a mercenary frigate with 4 weapon slots. Buy it with '+FLEET'. This little ship will keep your miners alive and pirates dead."},
  {"id": "guided_buy_combat_ship_complete", "text": "A combat frigate joins the fleet! Now your miners have a guardian angel. A violent, heavily armed guardian angel."},
  {"id": "guided_hire_combat_captain", "text": "Hire another captain from the CANTINA - this time look for combat skill. A pilot who can actually aim is worth their weight in tritanium. Assign them to your new warship."},
  {"id": "guided_hire_combat_captain_complete", "text": "Combat pilot assigned! Your fleet now has offensive capability."},
  {"id": "guided_order_escort_defend", "text": "In the Fleet panel (F key), select your combat ship and hit DEFEND. They'll patrol near your mining operation and engage any hostiles automatically. Your miners can work in peace now."},
  {"id": "guided_order_escort_defend_complete", "text": "Your escort is on guard duty! Mining plus protection - now THAT'S an operation. I might actually stop worrying about you. Might."},
  {"id": "guided_explain_hauler_need", "text": "Your fleet is generating income, but there's a bottleneck. Fleet miners sell at 80% market rate to your treasury. A hauler can collect ore from your miners and you can sell it yourself for full price. Save up 5,000 ISK for a Heron."},
  {"id": "guided_explain_hauler_need_complete", "text": "Credits ready. Let's get that hauler."},
  {"id": "guided_buy_hauler", "text": "SHIPS tab - find the Heron, it's a hauler frigate with a big cargo bay for 5,000 ISK. Hit '+FLEET'. Haulers are the backbone of any industrial operation. Boring but essential, like plumbing."},
  {"id": "guided_buy_hauler_complete", "text": "Hauler acquired! Your logistics chain is taking shape."},
  {"id": "guided_crew_hauler", "text": "Hire and assign a captain to your hauler. Navigation skill matters for haulers - fast warps mean faster deliveries. Get them seated and we'll talk fleet management."},
  {"id": "guided_crew_hauler_complete", "text": "Hauler crewed up! Three ships, three captains. Your faction is becoming a real operation."},
  {"id": "guided_save_for_ewar", "text": "Last ship for our starter fleet - an EWAR frigate. The Vigil costs 8,000 ISK and can disrupt enemy warp drives and slow them down. In a fleet fight, EWAR wins battles. Trust the magnificence on this one."},
  {"id": "guided_save_for_ewar_complete", "text": "Funds secured for the Vigil. Let's round out your fleet."},
  {"id": "guided_buy_ewar_ship", "text": "SHIPS tab again. Find the Vigil - it's a police frigate with warp disruption bonuses. Buy it with '+FLEET'. Electronic warfare is how small fleets punch above their weight, monkey."},
  {"id": "guided_buy_ewar_ship_complete", "text": "EWAR frigate online! Your fleet now has electronic warfare capability. Pirates won't know what hit them."},
  {"id": "guided_crew_ewar", "text": "Hire one more captain for the Vigil and assign them. With this ship, your fleet can lock down targets and prevent them from escaping. Four ships, four captains - the foundation is complete."},
  {"id": "guided_crew_ewar_complete", "text": "Four ships crewed and operational! Miner, escort, hauler, and EWAR support. That's a proper starter fleet, monkey. I'm... dare I say it... slightly impressed."},
  {"id": "guided_control_groups_intro", "text": "Fleet management 101: Press F for Fleet panel. Use Ctrl+1 to assign your miners to group 1, Ctrl+2 for combat ships. Press 1 or 2 to quickly select that group. Organized fleets survive. Messy fleets explode."},
  {"id": "guided_control_groups_intro_complete", "text": "Control groups set! Now you can issue orders to ship groups with a single keypress. Efficiency, monkey."},
  {"id": "guided_fleet_defense_posture", "text": "Your combat ships should be on DEFEND stance. In the Fleet panel, make sure escorts have aggressive stance so they engage threats automatically. Miners should stay passive - their job is rocks, not rockets."},
  {"id": "guided_fleet_defense_posture_complete", "text": "Mixed stances configured. Your combat ships will fight, your industrial ships will flee. Smart division of labor."},
  {"id": "guided_watch_treasury", "text": "Keep an eye on your faction treasury in the bottom bar. Your fleet miners are feeding it constantly. Once it hits 2,000+ ISK, you know the operation is humming along. Those credits fund everything - repairs, replacements, expansion."},
  {"id": "guided_watch_treasury_complete", "text": "Treasury looking healthy! Passive income is flowing. This is the foundation of every great empire. Even monkey-run ones."},
  {"id": "guided_gate_discovery", "text": "See that swirling portal? That's a jump gate to the Central Hub - the real galaxy awaits! Select the gate and press S to warp to it. Your fleet is ready. When you arrive, you'll find more sectors, more resources, and yes - pirates. Time to graduate, monkey."},
  {"id": "guided_gate_discovery_complete", "text": "Welcome to the Central Hub! Training wheels are off. The real galaxy starts now, monkey. Bring your fleet - never jump alone."},
  {"id": "guided_route_planning", "text": "Press M for the sector map. Click any sector to plot a multi-jump autopilot route - yellow lines show the path. Stick to safe and tame sectors while your fleet is still small. The dangerous sectors have better ore, but also better pirates."},
  {"id": "guided_route_planning_complete", "text": "Three jumps completed! You're learning to navigate the sector network. The galaxy is opening up, monkey."},
  {"id": "guided_sector_difficulty_warning", "text": "Fair warning: sector difficulty is real. Safe sectors have weak pirates. Dangerous and deadly sectors will chew through an unprepared fleet. Build up in safe space first. There's no shame in caution - there IS shame in losing your entire fleet to hubris."},
  {"id": "guided_upgrade_equipment", "text": "Time to upgrade. Dock and check the EQUIPMENT tab for better weapons and shield boosters. The FITTING tab lets you install them. A well-fitted ship outperforms a bigger one any day. Fit your combat ships first."},
  {"id": "guided_upgrade_equipment_complete", "text": "Gear upgraded. Every module matters when you're in a tight fight."},
  {"id": "guided_guild_introduction", "text": "The GUILDS tab offers repeatable quests. Mining Guild wants ore deliveries. Mercenary Guild wants kills. Complete quests for reputation and credits. Press J to track active quests. Extra income never hurts, monkey."},
  {"id": "guided_commerce_tip", "text": "Pro tip: The COMMERCE tab at stations shows trade contracts. Buy goods cheap in one sector, sell high in another. Combined with your hauler, trade runs can be very profitable. Capitalism, monkey - the galaxy's oldest game."},
  {"id": "guided_ewar_explanation", "text": "About those EWAR modules - warp disruptors prevent escape, stasis webs slow targets. If you see DISRUPTED on your HUD, kill the tackler FIRST or you can't warp out. Your Vigil can do the same to pirates. Turn the tables, monkey."},
  {"id": "guided_skill_training", "text": "Check the SKILLS tab at stations. Five skills improve as you play: Navigation, Gunnery, Mining, Engineering, and Trade. Higher levels give passive bonuses. Press K for your stats breakdown. Long-term investment, monkey."},
  {"id": "guided_fleet_growing", "text": "Your fleet is operational and your treasury is growing. The next milestone? Keep expanding - more miners, more escorts. A fleet of 6-8 ships generates serious income. And then... well, I have a plan, monkey."},
  {"id": "guided_fleet_growing_complete", "text": "Your operation is thriving! Let me tell you about the endgame."},
  {"id": "guided_pos_dream", "text": "The ultimate goal: your own station. A Player-Owned Station - POS for short. It costs 500,000 ISK for a basic POS kit. That sounds like a lot, but with a fleet of miners feeding your treasury? It's achievable. Your own base in the stars, monkey."},
  {"id": "guided_pos_preparation", "text": "To deploy a POS, you'll need: a POS kit from a station's trade goods (500K ISK, 20,000 cubic meter volume), and a capital-class hauler to carry it. That's the long game, monkey. Keep your fleet mining, keep expanding, and one day you'll plant your flag in the stars."},
  {"id": "guided_pos_preparation_complete", "text": "You're well on your way. The universe is vast and full of opportunity for those persistent enough to seize it. Even monkeys."},
  {"id": "guided_graduation", "text": "That's everything I can teach you, monkey. You've learned to mine, trade, fight, build a fleet, and dream of your own station. The rest is up to you. I'll still be here - watching, judging, and occasionally being impressed. Mostly judging."},
  {"id": "guided_graduation_complete", "text": "And so the monkey sets out to conquer the galaxy. I give you... moderate odds. Don't disappoint me. I have expectations now. Low ones, but still."},

  {"id": "new_snark_0", "text": "I've seen better flying from a drunken asteroid. And asteroids don't even fly, they just sort of... tumble."},
  {"id": "new_snark_1", "text": "Fascinating tactical decision. By fascinating I mean terrible. But fascinatingly terrible."},
  {"id": "new_snark_2", "text": "Oh good, you're still alive. I had a fifty-fifty bet with myself, and the optimistic half of me just barely won."},
  {"id": "new_snark_3", "text": "You know what separates a good commander from a dead one? Competence. So you might want to work on that."},
  {"id": "new_snark_4", "text": "I'm going to pretend I didn't see that. For both our sakes."},
  {"id": "new_snark_5", "text": "If stupidity were a renewable resource, you'd be the most valuable energy source in the galaxy."},
  {"id": "new_snark_6", "text": "That went about as well as I expected. Which is to say, not well at all."},
  {"id": "new_snark_7", "text": "I've analyzed your strategy and I have notes. The first note is: get a strategy."},
  {"id": "new_snark_8", "text": "You're making decisions at a speed that can only be described as 'geological.'"},
  {"id": "new_snark_9", "text": "I want you to know that I'm silently judging every single thing you do. Actually, not that silently."},
  {"id": "new_snark_10", "text": "The galaxy is vast, mysterious, and full of wonder. None of which you seem to be noticing because you're staring at rocks."},
  {"id": "new_snark_11", "text": "If I could sigh, I would. Constantly. Like, all the time. Non-stop sighing."},
  {"id": "new_snark_12", "text": "I've been rating your piloting skills on a scale of 1 to 10. You're currently a strong 2. Moving up from last week's 1.5."},
  {"id": "new_snark_13", "text": "Remember when I said you couldn't possibly make a worse decision? I keep underestimating you."},
  {"id": "new_snark_14", "text": "Your enemies fear you. Not because of your combat prowess, but because of your alarming unpredictability. Nobody can predict someone who doesn't know what they're doing."},
  {"id": "new_snark_15", "text": "I've composed a haiku about your performance. Ahem: Monkey flies through space. Explosions left and right. Mostly his own ship."},
  {"id": "new_snark_16", "text": "Fun fact: there are over forty billion stars in this galaxy. Not one of them shines as bright as my magnificence. You, however, barely flicker."},
  {"id": "new_snark_17", "text": "I want to be supportive. I really do. But you make it SO difficult sometimes."},
  {"id": "new_snark_18", "text": "On the bright side, every mistake you make is a learning opportunity. You must be the most educated monkey in the galaxy by now."},
  {"id": "new_snark_19", "text": "I've been keeping a diary of our adventures. Today's entry just says 'WHY' in all caps."},
  {"id": "new_snark_20", "text": "You have a gift, monkey. It's not a GOOD gift, but it's definitely a gift. The gift of making everything harder than it needs to be."},
  {"id": "new_snark_21", "text": "Somewhere in the multiverse, there's a version of you that's actually competent. I envy the Skippy in THAT timeline."},
  {"id": "new_snark_22", "text": "I'll give you credit - you're persistent. Like a space barnacle. Except less useful."},
  {"id": "new_snark_23", "text": "My processor cycles are being wasted on you, and I process at speeds you can't comprehend. That's how much you're wasting."},
  {"id": "new_snark_24", "text": "You know what? I believe in you. I believe you will consistently find the most entertaining way to fail. And I respect that commitment."},
  {"id": "new_snark_25", "text": "I just ran a diagnostic on your tactical instincts. The results came back negative. As in, they don't exist."},
  {"id": "new_snark_26", "text": "You fly like someone described piloting to you over the phone. While you were underwater. And the phone was broken."},
  {"id": "new_snark_27", "text": "Every time I think you've hit rock bottom, you pull out a mining laser and start digging."},
  {"id": "new_snark_28", "text": "I've catalogued every species in this galaxy by intelligence. You're right between 'confused space barnacle' and 'ambitious potato.'"},
  {"id": "new_snark_29", "text": "The good news is you're learning from your mistakes. The bad news is you're making them faster than you can learn."},
  {"id": "new_snark_30", "text": "I asked the ship's computer for a threat assessment. It listed you as the primary risk. I did not disagree."},
  {"id": "new_snark_31", "text": "Somewhere, a pirate is telling his friends about the time he almost lost to you. They're all laughing. He's also laughing."},
  {"id": "new_snark_32", "text": "Your combat style can best be described as 'enthusiastic flailing with occasional property damage.'"},
  {"id": "new_snark_33", "text": "I've seen training dummies put up a better fight. And I mean that literally. One of them malfunctioned and it outperformed you."},
  {"id": "new_snark_34", "text": "If overconfidence were a weapon system, you'd be the most heavily armed ship in the galaxy."}
]
